Revit 2024 API
Parameter.AsDouble Method
Provides access to the double precision number within the parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double AsDouble()
Visual Basic
Public Function AsDouble As Double
Visual C++
public:
double AsDouble()
Return Value
The double value contained in the parameter.
Remarks
The AsDouble method should only be used if the StorageType property returns that the internal contents of the parameter is a double.
See Also
Parameter Class
Autodesk.Revit.DB Namespace